read_verilog alu.v

synth -top alu

write_verilog alu_netlist.v